<?php
namespace app\components;

class Helpers
{
    static function ukr2translit($str)
    {
        $ukr = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Є',  'Ж',  'З', 'И', 'І', 'Ї',  'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х',  'Ц',  'Ч',  'Ш',  'Щ',    'Ь', 'Ю',  'Я',
                'а', 'б', 'в', 'г', 'д', 'е', 'є',  'ж',  'з', 'и', 'і', 'ї',  'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х',  'ц',  'ч',  'ш',  'щ',    'ь', 'ю',  'я', '\''];
        $lat = ['A', 'B', 'V', 'G', 'D', 'E', 'Ye', 'Zh', 'Z', 'Y', 'I', 'Yi', 'Y', 'K', 'L', 'M', 'N', 'O', 'P', 'R', 'S', 'T', 'U', 'F', 'Kh', 'Ts', 'Ch', 'Sh', 'Shch', '',  'Yu', 'Ya',
                'a', 'b', 'v', 'g', 'd', 'e', 'ie', 'zh', 'z', 'y', 'i', 'i',  'i', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'kh', 'ts', 'ch', 'sh', 'shch', '',  'iu', 'ia', ''];

        return str_replace($ukr, $lat, $str);
    }
}